app/views/taxis/index.html.erb

SELECT "logins".* FROM "logins" WHERE "logins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
<%end%>
<% login=Login.find(1).idclient %>

SELECT COUNT(*) FROM "lists" WHERE "lists"."idtaxi" = $1  [["idtaxi", 3]]
---
          <td>
             <%= List.where(idtaxi:taxi.id).count %>