app/views/home/about.html.erb

SELECT "logins".* FROM "logins" WHERE "logins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "positions".* FROM "positions" WHERE "positions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "chemins".* FROM "chemins" WHERE "chemins"."chemin" = $1 ORDER BY "chemins"."id" ASC  [["chemin", 6]]
SELECT "idchemins".* FROM "idchemins" WHERE "idchemins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
<p style="color: green"><%= notice %></p>
<% login=Login.find(1).idclient %>
<% client=Position.find(login) %>
<% data=Chemin.where(chemin:Idchemin.find(1).idchem).order(:id) %>

SELECT COUNT(*) FROM "lists" WHERE "lists"."idtaxi" = $1  [["idtaxi", 3]]
---
    <% @taxis.each do |taxi| %>
      <% nbrepassager=List.where(idtaxi:taxi.id).count %>

SELECT "lists".* FROM "lists" WHERE "lists"."idtaxi" = $1 AND "lists"."idclient" = $2  [["idtaxi", 2], ["idclient", 3]]
---
          <td>
            <% the= List.where(idtaxi:taxi.id, idclient:login)

SELECT "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
SELECT COUNT(*) FROM "lists" WHERE "lists"."idtaxi" = $1  [["idtaxi", 2]]
---
             <% if count==1 then %>
             <%= button_to "Miala ao @ le Taxi", List.find(the[0].id), method: :delete %>
             <% elsif count==0 and List.where(idtaxi:taxi.id).count<2  then %>