app/controllers/chemins_controller.rb

SELECT "chemins".* FROM "chemins" WHERE "chemins"."chemin" = $1 ORDER BY "chemins"."id" ASC  [["chemin", 6]]
---
  def index
    @chemins = Chemin.where(chemin:session[:chemin]).order(:id)

SELECT "chemins".* FROM "chemins" WHERE "chemins"."chemin" = $1 ORDER BY "chemins"."id" ASC  [["chemin", 6]]
---
  def list
    @chemins = Chemin.where(chemin:params[:chemin]).order(:id)

INSERT INTO "chemins" ("chemin", "x", "y", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["chemin", 1], ["x", 1], ["y", 1], ["created_at", "2022-06-21 05:54:21.445631"], ["updated_at", "2022-06-21 05:54:21.445631"]]
---
  def create
    @chemin = Chemin.new(chemin_params)

    respond_to do |format|
      if @chemin.save

UPDATE "chemins" SET "x" = $1, "y" = $2, "updated_at" = $3 WHERE "chemins"."id" = $4  [["x", 5], ["y", 6], ["updated_at", "2026-03-24 19:44:59.052100"], ["id", 32]]
---
  def update
    respond_to do |format|
      if @chemin.update(chemin_params)

SELECT "chemins".* FROM "chemins" WHERE "chemins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_chemin
      @chemin = Chemin.find(params[:id])