app/controllers/home_controller.rb

SELECT "logins".* FROM "logins" WHERE "logins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "taxis".* FROM "taxis" WHERE ( |/(((SELECT "positions"."x" FROM "positions" WHERE "positions"."id" = 1)-x)^2+((SELECT "positions"."y" FROM "positions" WHERE "positions"."id" = 1)-y)^2) <= (SELECT "positions"."distance" FROM "positions" WHERE "positions"."id" = 1) and mijanona=0)
SELECT "positions".* FROM "positions" WHERE "positions"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "positions".* FROM "positions" WHERE "positions"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def about
    login=Login.find(1).idclient
    distance=Position.select("distance").where(id:login)
    xs=Position.select("x").where(id:login)
    ys=Position.select("y").where(id:login)
    @taxis=Taxi.where(" |/(((#{xs.to_sql})-x)^2+((#{ys.to_sql})-y)^2) <= (#{distance.to_sql}) and mijanona=0")
    @dis = Position.find(login)

SELECT "logins".* FROM "logins" WHERE "logins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "positions".* FROM "positions" WHERE "positions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "positions" SET "dx" = $1, "dy" = $2, "updated_at" = $3 WHERE "positions"."id" = $4  [["dx", 25], ["dy", 35], ["updated_at", "2026-03-24 18:33:35.975685"], ["id", 1]]
UPDATE "positions" SET "updated_at" = $1, "distance" = $2 WHERE "positions"."id" = $3  [["updated_at", "2022-06-08 10:07:12.782227"], ["distance", 3], ["id", 1]]
---
  def go
    # set position of current client
    pos=Position.find(Login.find(1).idclient)
    pos.update(distance:params[:distance],dx:params[:dx],dy:params[:dy])
    pos.save

SELECT "ways".* FROM "ways" WHERE "ways"."ax" = $1 AND "ways"."ay" = $2  [["ax", 10], ["ay", 15]]
SELECT "idchemins".* FROM "idchemins" WHERE "idchemins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "idchemins" SET "idchem" = $1, "updated_at" = $2 WHERE "idchemins"."id" = $3  [["idchem", "5"], ["updated_at", "2026-03-24 18:56:59.524372"], ["id", 1]]
SELECT "taxis".* FROM "taxis" WHERE "taxis"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "taxis" SET "status" = $1, "updated_at" = $2 WHERE "taxis"."id" = $3  [["status", 0], ["updated_at", "2026-03-24 18:56:59.533493"], ["id", 1]]
---
  def aller
    # set idchem to chemin of way where way.arrive=client.arrive
    route=Way.where(ax:params[:dx],ay:params[:dy])[0]
    idchem=Idchemin.find(1)
    idchem.update(idchem:route.chemin)
    idchem.save
    # set status taxi nidirana
    t=Taxi.find(params[:idtaxi])
    t.update(status:"en route vers "+route.arrive.to_str)