app/controllers/idchemins_controller.rb

SELECT "idchemins".* FROM "idchemins"
---
  def index
    @idchemins = Idchemin.all

INSERT INTO "idchemins" ("idchem", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["idchem", "1"], ["created_at", "2022-06-21 10:56:46.363817"], ["updated_at", "2022-06-21 10:56:46.363817"]]
---
  def create
    @idchemin = Idchemin.new(idchemin_params)

    respond_to do |format|
      if @idchemin.save

SELECT "idchemins".* FROM "idchemins" WHERE "idchemins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_idchemin
      @idchemin = Idchemin.find(params[:id])