app/controllers/lists_controller.rb

def miditra
    client=Position.find(params[:idclient])
    @l=List.new
    @l.idtaxi=params[:idtaxi]
    @l.idclient=params[:idclient]
    taxi=Taxi.find(params[:idtaxi])
    # set position and destination taxi to position and destination curr client

    taxi.update(x:client.x, y:client.y,dx:client.dx,dy:client.dy,status:"arret")
    taxi.save
    @l.save
---
SELECT "positions".* FROM "positions" WHERE "positions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "taxis".* FROM "taxis" WHERE "taxis"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "taxis" SET "x" = $1, "y" = $2, "dx" = $3, "dy" = $4, "status" = $5, "updated_at" = $6 WHERE "taxis"."id" = $7  [["x", 12], ["y", 22], ["dx", 10], ["dy", 15], ["status", 0], ["updated_at", "2026-03-24 18:39:03.852690"], ["id", 1]]
INSERT INTO "lists" ("idtaxi", "idclient", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["idtaxi", 1], ["idclient", 1], ["created_at", "2026-03-24 18:39:03.863626"], ["updated_at", "2026-03-24 18:39:03.863626"]]

  def create
    @list = List.new(list_params)

    respond_to do |format|
      if @list.save
---
INSERT INTO "lists" ("idTaxi", "idCLient", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["idTaxi", 2], ["idCLient", 1], ["created_at", "2022-06-10 13:52:13.533242"], ["updated_at", "2022-06-10 13:52:13.533242"]]