app/controllers/logins_controller.rb

SELECT "logins".* FROM "logins"
---
  def index
    @logins = Login.all

INSERT INTO "logins" ("idClient", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["idClient", "1"], ["created_at", "2022-06-10 13:32:02.459782"], ["updated_at", "2022-06-10 13:32:02.459782"]]
---
  def create
    @login = Login.new(login_params)

    respond_to do |format|
      if @login.save

UPDATE "logins" SET "idClient" = $1, "updated_at" = $2 WHERE "logins"."id" = $3  [["idClient", "2"], ["updated_at", "2022-06-10 13:33:14.239699"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @login.update(login_params)

SELECT "logins".* FROM "logins" WHERE "logins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_login
      @login = Login.find(params[:id])