app/controllers/positions_controller.rb

  def index
    @positions = Position.all
---
SELECT "positions".* FROM "positions"

  def create
    @position = Position.new(position_params)

    respond_to do |format|
      if @position.save
---
INSERT INTO "positions" ("x", "y", "distance", "dx", "dy", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["x", 2], ["y", 1], ["distance", 5], ["dx", 2], ["dy", 1], ["created_at", "2026-03-24 17:55:21.850318"], ["updated_at", "2026-03-24 17:55:21.850318"]]

  def update

    respond_to do |format|
      if @position.update(position_params)
---
UPDATE "positions" SET "x" = $1, "y" = $2, "updated_at" = $3, "distance" = $4 WHERE "positions"."id" = $5  [["x", 2], ["y", 2], ["updated_at", "2022-06-10 15:11:13.299080"], ["distance", 5], ["id", 4]]

  def destroy
    @position.destroy
---
DELETE FROM "positions" WHERE "positions"."id" = $1  [["id", 1]]

    def set_position
      @position = Position.find(params[:id])
---
SELECT "positions".* FROM "positions" WHERE "positions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]