app/controllers/taxis_controller.rb

  def index
    @taxis = Taxi.all
---
SELECT "taxis".* FROM "taxis"

  def test
    @tax = Taxi.find(params[:id])
    if params[:check] == '1'
      @tax.mijanona=1
      @tax.save
    elsif params[:check] == '0'
      @tax.mijanona=0
      @tax.save
---
SELECT "taxis".* FROM "taxis" WHERE "taxis"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "taxis" SET "updated_at" = $1, "mijanona" = $2 WHERE "taxis"."id" = $3  [["updated_at", "2022-06-07 14:49:09.653421"], ["mijanona", 1], ["id", 3]]
UPDATE "taxis" SET "updated_at" = $1, "mijanona" = $2 WHERE "taxis"."id" = $3  [["updated_at", "2022-06-07 14:51:37.962084"], ["mijanona", 0], ["id", 3]]

  def create
    @taxi = Taxi.new(taxi_params)

    respond_to do |format|
      if @taxi.save
---
INSERT INTO "taxis" ("numero", "x", "y", "created_at", "updated_at", "mijanona", "dx", "dy", "status") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"  [["numero", "4456tgb"], ["x", 2], ["y", 3], ["created_at", "2022-06-21 06:45:35.199883"], ["updated_at", "2022-06-21 06:45:35.199883"], ["mijanona", 0], ["dx", 5], ["dy", 5], ["status", ""]]

  def update
    respond_to do |format|
      if @taxi.update(taxi_params)
---
UPDATE "taxis" SET "x" = $1, "y" = $2, "updated_at" = $3 WHERE "taxis"."id" = $4  [["x", 3], ["y", 3], ["updated_at", "2022-06-10 15:16:28.440551"], ["id", 3]]

  def destroy
    @taxi.destroy
---
DELETE FROM "taxis" WHERE "taxis"."id" = $1  [["id", 5]]

    def set_taxi
      @taxi = Taxi.find(params[:id])
---
SELECT "taxis".* FROM "taxis" WHERE "taxis"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]