app/controllers/ways_controller.rb

SELECT "ways".* FROM "ways"
---
  def index
    @ways = Way.all

INSERT INTO "ways" ("depart", "arrive", "chemin", "dx", "dy", "ax", "ay", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"  [["depart", "A"], ["arrive", "b"], ["chemin", 1], ["dx", 1], ["dy", 1], ["ax", 5], ["ay", 5], ["created_at", "2022-06-21 05:50:39.305996"], ["updated_at", "2022-06-21 05:50:39.305996"]]
---
  def create
    @way = Way.new(way_params)

    respond_to do |format|
      if @way.save

UPDATE "ways" SET "arrive" = $1, "updated_at" = $2 WHERE "ways"."id" = $3  [["arrive", "B"], ["updated_at", "2022-06-21 05:58:11.730408"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @way.update(way_params)

DELETE FROM "ways" WHERE "ways"."id" = $1  [["id", 2]]
---
  def destroy
    @way.destroy

SELECT "ways".* FROM "ways" WHERE "ways"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_way
      @way = Way.find(params[:id])