app/models/position.rb

	def self.fill
		@dis = Position.find(Login.find(1).idclient)
---
SELECT "logins".* FROM "logins" WHERE "logins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "positions".* FROM "positions" WHERE "positions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]