app/models/taxi.rb

	def self.fill
		@list=Taxi.all
	    str=""
	    @list.each do |each|
---
SELECT "taxis".* FROM "taxis" WHERE (mijanona=0)